src/Catalogs/Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Заявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>communication_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>communication_type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращенийCoMagic</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ct_cid</Name>
					<Comment>Calltouch Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fbc</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fbp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fitness1c_cid</Name>
					<Comment>Для быстрого получения УИД контрагента в отчетах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ga_cid</Name>
					<Comment>Google Analitics Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rs_cid</Name>
					<Comment>Roistat Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rs_vid</Name>
					<Comment>Roistat Visit ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>uid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>user_agent</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_campaign</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_content</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_medium</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_source</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_term</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ym_cid</Name>
					<Comment>Yandex Metrics Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Comment>РекламнаяПлощадка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентИзВиджетаЛК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОценкиКачестваЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчаствоватьВРассылке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияСтатусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходИзСтатуса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходВСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбработана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропущенныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвеченныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвеченныйДиалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перезвонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Заявки/Ext/ObjectModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию.
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект,, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения)
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЭтотОбъект.communication_id			 = ?(ДанныеЗаполнения.Свойство("communication_id")  		, ДанныеЗаполнения.communication_id  		, ЭтотОбъект.communication_id);
		ЭтотОбъект.communication_type		 = ?(ДанныеЗаполнения.Свойство("communication_type")		, ДанныеЗаполнения.communication_type		, ЭтотОбъект.communication_type);
		ЭтотОбъект.ДатаСоздания				 = ?(ДанныеЗаполнения.Свойство("ДатаСоздания")      		, ДанныеЗаполнения.ДатаСоздания      		, ЭтотОбъект.ДатаСоздания);
		ЭтотОбъект.Фамилия					 = ?(ДанныеЗаполнения.Свойство("Фамилия")           		, ДанныеЗаполнения.Фамилия           		, ЭтотОбъект.Фамилия);
		ЭтотОбъект.Имя						 = ?(ДанныеЗаполнения.Свойство("Имя")               		, ДанныеЗаполнения.Имя               		, ЭтотОбъект.Имя);
		ЭтотОбъект.Отчество					 = ?(ДанныеЗаполнения.Свойство("Отчество")          		, ДанныеЗаполнения.Отчество          		, ЭтотОбъект.Отчество);
		ЭтотОбъект.РекламныйИсточник		 = ?(ДанныеЗаполнения.Свойство("РекламныйИсточник") 		, ДанныеЗаполнения.РекламныйИсточник 		, ЭтотОбъект.РекламныйИсточник);
		ЭтотОбъект.РекламнаяСсылка			 = ?(ДанныеЗаполнения.Свойство("РекламнаяСсылка")   		, ДанныеЗаполнения.РекламнаяСсылка   		, ЭтотОбъект.РекламнаяСсылка);
		ЭтотОбъект.ОсновнойКлиент			 = ?(ДанныеЗаполнения.Свойство("ОсновнойКлиент")    		, ДанныеЗаполнения.ОсновнойКлиент    		, ЭтотОбъект.ОсновнойКлиент);
		ЭтотОбъект.ОсновнойМенеджер			 = ?(ДанныеЗаполнения.Свойство("ОсновнойМенеджер")  		, ДанныеЗаполнения.ОсновнойМенеджер  		, ЭтотОбъект.ОсновнойМенеджер);
		ЭтотОбъект.Комментарий				 = ?(ДанныеЗаполнения.Свойство("Комментарий")       		, ДанныеЗаполнения.Комментарий       		, ЭтотОбъект.Комментарий);
		ЭтотОбъект.Статус					 = ?(ДанныеЗаполнения.Свойство("Статус")		    		, ДанныеЗаполнения.Статус		     		, ЭтотОбъект.Статус);
		ЭтотОбъект.ОценкаЗаявки				 = ?(ДанныеЗаполнения.Свойство("ОценкаЗаявки")      		, ДанныеЗаполнения.ОценкаЗаявки      		, ЭтотОбъект.ОценкаЗаявки);
		ЭтотОбъект.СтруктурнаяЕдиница		 = ?(ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница")		, ДанныеЗаполнения.СтруктурнаяЕдиница		, ЭтотОбъект.СтруктурнаяЕдиница);
		ЭтотОбъект.ВнешняяСистема			 = ?(ДанныеЗаполнения.Свойство("ВнешняяСистема")			, ДанныеЗаполнения.ВнешняяСистема			, ЭтотОбъект.ВнешняяСистема);
		ЭтотОбъект.КаналПривлечения			 = ?(ДанныеЗаполнения.Свойство("РекламнаяПлощадка")			, ДанныеЗаполнения.РекламнаяПлощадка		, ЭтотОбъект.КаналПривлечения);
		ЭтотОбъект.КаналПривлеченияЗначение	 = ?(ДанныеЗаполнения.Свойство("КаналПривлеченияЗначение")	, ДанныеЗаполнения.КаналПривлеченияЗначение	, ЭтотОбъект.КаналПривлеченияЗначение);
		ЭтотОбъект.ВходящийНомерТелефона	 = ?(ДанныеЗаполнения.Свойство("ВходящийНомерТелефона")		, ДанныеЗаполнения.ВходящийНомерТелефона	, ЭтотОбъект.ВходящийНомерТелефона);
		
		// На случай если напрямую передали
		ЭтотОбъект.utm_source   = ?(ДанныеЗаполнения.Свойство("source")  		, ДанныеЗаполнения.source  		, ЭтотОбъект.utm_source);
		ЭтотОбъект.utm_medium   = ?(ДанныеЗаполнения.Свойство("medium")  		, ДанныеЗаполнения.medium  		, ЭтотОбъект.utm_medium);
		ЭтотОбъект.utm_campaign = ?(ДанныеЗаполнения.Свойство("campaign")		, ДанныеЗаполнения.campaign		, ЭтотОбъект.utm_campaign);
		ЭтотОбъект.utm_content  = ?(ДанныеЗаполнения.Свойство("content") 		, ДанныеЗаполнения.content 		, ЭтотОбъект.utm_content);
		ЭтотОбъект.utm_term     = ?(ДанныеЗаполнения.Свойство("term")    		, ДанныеЗаполнения.term    		, ЭтотОбъект.utm_term);
		ЭтотОбъект.ip     		= ?(ДанныеЗаполнения.Свойство("ip")    			, ДанныеЗаполнения.ip    		, ЭтотОбъект.ip);
		ЭтотОбъект.user_agent   = ?(ДанныеЗаполнения.Свойство("user_agent")    	, ДанныеЗаполнения.user_agent	, ЭтотОбъект.user_agent);
		
		ЭтотОбъект.ym_cid     = ?(ДанныеЗаполнения.Свойство("ym_cid")    , ДанныеЗаполнения.ym_cid    , ЭтотОбъект.ym_cid);
		ЭтотОбъект.ga_cid     = ?(ДанныеЗаполнения.Свойство("ga_cid")    , ДанныеЗаполнения.ga_cid    , ЭтотОбъект.ga_cid);
		ЭтотОбъект.ct_cid     = ?(ДанныеЗаполнения.Свойство("ct_cid")    , ДанныеЗаполнения.ct_cid    , ЭтотОбъект.ct_cid);
		ЭтотОбъект.rs_cid     = ?(ДанныеЗаполнения.Свойство("rs_cid")    , ДанныеЗаполнения.rs_cid    , ЭтотОбъект.rs_cid);
		ЭтотОбъект.rs_vid     = ?(ДанныеЗаполнения.Свойство("rs_vid")    , ДанныеЗаполнения.rs_vid    , ЭтотОбъект.rs_vid);
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВнешняяСистема) И ЭтотОбъект.ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet Тогда
			ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.НеОбработана;
		// ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ОсновнойКлиент) И НЕ ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята Тогда
		//	ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята;	
		КонецЕсли;	
		
		Если ДанныеЗаполнения.Свойство("НомерТелефона") 
			И ЗначениеЗаполнено(ДанныеЗаполнения.НомерТелефона) Тогда  
			
			ВидКИ         = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента; 
			ТипКИ         = Перечисления.ТипыКонтактнойИнформации.Телефон;
			
			// ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(ДанныеЗаполнения.НомерТелефона, ВидКИ); 			
			// Необходимо прокидывать структурную единицу, чтобы точно определять формат телефона.
			ЗначенияПолей = КонтактнаяИнформацияXMLПоПредставлению(ДанныеЗаполнения.НомерТелефона, ВидКИ, ЭтотОбъект.СтруктурнаяЕдиница);
			
			УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформациюСтоматология(ЭтотОбъект, ЗначенияПолей, ВидКИ, ТипКИ);
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("АдресЭП") 
			И ЗначениеЗаполнено(ДанныеЗаполнения.АдресЭП) Тогда  
			
			ВидКИ         	= Справочники.ВидыКонтактнойИнформации.EmailКлиента; 
			ТипКИ         	= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			Значение 		= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияПоПредставлению(ДанныеЗаполнения.АдресЭП, ВидКИ));
			
			УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформациюСтоматология(ЭтотОбъект, Значение, ВидКИ, ТипКИ);
			
		КонецЕсли;	
		
		Если ДанныеЗаполнения.Свойство("КонтактнаяИнформацияСоцСеть")
			И ЗначениеЗаполнено(ДанныеЗаполнения.КонтактнаяИнформацияСоцСеть) Тогда
			
			ВидКИ	 = Справочники.ВидыКонтактнойИнформации.СоциальнаяСетьКлиента;
			ТипКИ	 = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть;
			
			Для Каждого Контакт Из ДанныеЗаполнения.КонтактнаяИнформацияСоцСеть Цикл
				
				СтруктураКонтакта	= УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияПоПредставлению(Контакт.Значение, ВидКИ);
				Значение			= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураКонтакта);
				
				ДополнительныеРеквизиты = Новый Структура("Комментарий", Контакт.Ключ);
				
				УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформациюСтоматология(ЭтотОбъект, Значение, ВидКИ, ТипКИ,,, ДополнительныеРеквизиты);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ПараметрыUTM") Тогда
			
			ПараметрыUTM = ДанныеЗаполнения.ПараметрыUTM;
			
			Если ЗначениеЗаполнено(ПараметрыUTM)
				И ТипЗнч(ПараметрыUTM) = Тип("Структура") Тогда
							
				ЭтотОбъект.utm_source   = ?(ПараметрыUTM.Свойство("source")  , ПараметрыUTM.source  , ЭтотОбъект.utm_source);
				ЭтотОбъект.utm_medium   = ?(ПараметрыUTM.Свойство("medium")  , ПараметрыUTM.medium  , ЭтотОбъект.utm_medium);
				ЭтотОбъект.utm_campaign = ?(ПараметрыUTM.Свойство("campaign"), ПараметрыUTM.campaign, ЭтотОбъект.utm_campaign);
				ЭтотОбъект.utm_content  = ?(ПараметрыUTM.Свойство("content") , ПараметрыUTM.content , ЭтотОбъект.utm_content);
				ЭтотОбъект.utm_term     = ?(ПараметрыUTM.Свойство("term")    , ПараметрыUTM.term    , ЭтотОбъект.utm_term);
				
				ЭтотОбъект.ym_cid     = ?(ПараметрыUTM.Свойство("ym_cid")    , ПараметрыUTM.ym_cid    , ЭтотОбъект.ym_cid);
				ЭтотОбъект.ga_cid     = ?(ПараметрыUTM.Свойство("ga_cid")    , ПараметрыUTM.ga_cid    , ЭтотОбъект.ga_cid);
				ЭтотОбъект.ct_cid     = ?(ПараметрыUTM.Свойство("ct_cid")    , ПараметрыUTM.ct_cid    , ЭтотОбъект.ct_cid);
				ЭтотОбъект.rs_cid     = ?(ПараметрыUTM.Свойство("rs_cid")    , ПараметрыUTM.rs_cid    , ЭтотОбъект.rs_cid);
				ЭтотОбъект.rs_vid     = ?(ПараметрыUTM.Свойство("rs_vid")    , ПараметрыUTM.rs_vid    , ЭтотОбъект.rs_vid);
				ЭтотОбъект.ip	      = ?(ПараметрыUTM.Свойство("ip")    	 , ПараметрыUTM.ip    	  , ЭтотОбъект.ip);
				ЭтотОбъект.user_agent = ?(ПараметрыUTM.Свойство("user_agent"), ПараметрыUTM.user_agent, ЭтотОбъект.user_agent);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтотОбъект.ga_cid 	 		  =	 СократитьGoogleID(ЭтотОбъект.ga_cid);
		
		Если ДанныеЗаполнения.Свойство("ЛидФорма") Тогда
			ЭтотОбъект.КаналПривлеченияЗначение = ДанныеЗаполнения.ЛидФорма;	
		КонецЕсли;
		
	КонецЕсли;
	
	// Установить статусы пациента 
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатусПациента) Тогда
		УстановитьПризнакПервичногоПациента();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработка проверки заполнения.
//
// Параметры:
//  Отказ				 - 	 -
//  ПроверяемыеРеквизиты - 	 -
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаявок.Отклонена Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОценкаЗаявки"));
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Перед записью.
//
// Параметры:
//  Отказ	 - 	 -
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина 
		ИЛИ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбменДаннымиЗагрузка") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
		
		ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.НеОбработана;
		
	ИначеЕсли ЭтотОбъект.Статус <> Перечисления.СтатусыЗаявок.Отклонена Тогда
		
		ЭтотОбъект.ОценкаЗаявки = Неопределено;
		
	ИначеЕсли ЭтотОбъект.Статус <> Перечисления.СтатусыЗаявок.Принята Тогда
		
		ЭтотОбъект.ОсновнойКлиент = Неопределено;
		
	КонецЕсли;
		
	Если ЭтотОбъект.Статус <> ЭтотОбъект.Ссылка.Статус Тогда	
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусЗаявкиИзменен", Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаСоздания) Тогда
		ЭтотОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда 
		АктуализироватьНаименованиеОбращения();
	КонецЕсли;
	
	Если ЭтотОбъект.РекламныйИсточник <> Справочники.РекламныеИсточники.ДругойПациент Тогда		
		ЭтотОбъект.ИсточникИнформацииЗначение = Неопределено;		
	КонецЕсли;
	
	// Установить статусы пациента 
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатусПациента) Тогда
		УстановитьПризнакПервичногоПациента();
	КонецЕсли;
	
	Если ЭтотОбъект.КонтактнаяИнформация.Количество() > 0 Тогда
		
		НомераТелефонов = Новый Массив;
		Для Каждого СтрокаКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И НЕ ПустаяСтрока(СтрокаКИ.Представление) Тогда
				НомераТелефонов.Добавить(СтрокаКИ.Представление);
			КонецЕсли;
		КонецЦикла;
		
		ЭтотОбъект.НомерТелефона = СтрСоединить(НомераТелефонов, ", ");
		
		АдресаЭП = Новый Массив;
		Для Каждого СтрокаКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
				АдресаЭП.Добавить(СтрокаКИ.Представление);
			КонецЕсли;
		КонецЦикла;
		
		ЭтотОбъект.АдресЭП = СтрСоединить(АдресаЭП, ", ");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.РекламныйИсточник) Тогда
		
		ПараметрыПоиска = Новый Структура();
		ПараметрыПоиска.Вставить("source"		, ЭтотОбъект.utm_source);
		ПараметрыПоиска.Вставить("medium"		, ЭтотОбъект.utm_medium);
		ПараметрыПоиска.Вставить("campaign"		, ЭтотОбъект.utm_campaign);
		ПараметрыПоиска.Вставить("content"		, ЭтотОбъект.utm_content);
		ПараметрыПоиска.Вставить("term"			, ЭтотОбъект.utm_term);
		ПараметрыПоиска.Вставить("комментарий"	, ЭтотОбъект.Комментарий);
		
		РекламныйИсточникПоМеткамUTM = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоПараметрамЗаявки(ПараметрыПоиска);
		
		Если Не ЗначениеЗаполнено(РекламныйИсточникПоМеткамUTM) Тогда
			
			ИмяКвиз = ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ИмяКвиз"), ЭтотОбъект.ДополнительныеСвойства.ИмяКвиз, "");
			ЭтотОбъект.РекламныйИсточник = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникВнешнейСистемы(ЭтотОбъект.ВнешняяСистема.ТипВнешнейСистемы, ИмяКвиз)
			
		Иначе
			
			ЭтотОбъект.РекламныйИсточник = РекламныйИсточникПоМеткамUTM;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Пропишем УИД
	Если ЗначениеЗаполнено(ЭтотОбъект.ОсновнойКлиент) И fitness1c_cid <> ЭтотОбъект.ОсновнойКлиент.УникальныйИдентификатор() Тогда 
		 ЭтотОбъект.fitness1c_cid = ЭтотОбъект.ОсновнойКлиент.УникальныйИдентификатор();
	КонецЕсли;
	
	ЗаписатьИзменениеСтатуса();
	
	// Синхронизация заявки со сделкой
	СинхронизироватьОбъектСоСделкой();
	
КонецПроцедуры

// Процедура - При записи.
//
// Параметры:
//  Отказ	 - 	 -
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина 
		ИЛИ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбменДаннымиЗагрузка") Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьМенеджеровОНовойЗаявке();
											
	Если ДополнительныеСвойства.Свойство("КоллтрекингНомер") И ЗначениеЗаполнено(ДополнительныеСвойства.КоллтрекингНомер) И 
		ДополнительныеСвойства.Свойство("ПОIPТелефонии") И ЗначениеЗаполнено(ДополнительныеСвойства.ПОIPТелефонии) Тогда
		ПараметрыЗапроса = Новый Структура;
		РеквизитыЗаявки = ЭтотОбъект.Метаданные().Реквизиты;
		Для Каждого РеквизитЗаявки Из РеквизитыЗаявки Цикл 
			ПараметрыЗапроса.Вставить(РеквизитЗаявки.Имя, ЭтотОбъект[РеквизитЗаявки.Имя]);
		КонецЦикла;
		ПараметрыЗапроса.Вставить("Ссылка"				, ЭтотОбъект.Ссылка);
		ПараметрыЗапроса.Вставить("КоллтрекингНомер"	, ?(ДополнительныеСвойства.Свойство("КоллтрекингНомер")	, ДополнительныеСвойства.КоллтрекингНомер	, ""));
		ПараметрыЗапроса.Вставить("IDЗвонка"			, ?(ДополнительныеСвойства.Свойство("IDЗвонка")			, ДополнительныеСвойства.IDЗвонка			, ""));
		ПараметрыЗапроса.Вставить("ПОIPТелефонии"		, ?(ДополнительныеСвойства.Свойство("ПОIPТелефонии")	, ДополнительныеСвойства.ПОIPТелефонии		, ""));		
		ПараметрыДлительнойОперации = IPТелефония.MANGO_ПолучитьИнформациюОПосетителеСайта(Строка(ДополнительныеСвойства.УникальныйИдентификатор), ПараметрыЗапроса);
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусЗаявкиИзменен")
		И (ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята
		ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Отклонена) Тогда
		
		ТипВнешнейСистемыЗаявки = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.ВнешняяСистема, "ТипВнешнейСистемы");
		
		Если ТипВнешнейСистемыЗаявки = Перечисления.ТипыВнешнихСистем.Calltouch
			ИЛИ ТипВнешнейСистемыЗаявки = Перечисления.ТипыВнешнихСистем.CoMagic Тогда
			
			СтатусСА = ?(ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята
					   , Перечисления.СтатусыСквознойАналитики.ЗаявкаПринята
					   , Перечисления.СтатусыСквознойАналитики.ЗаявкаОтклонена);
			
			ВнешниеСистемыПоТипу = Справочники.ВнешниеСистемы.ПолучитьВнешниеСистемы(ТипВнешнейСистемыЗаявки);
			
			Для Каждого ВС Из ВнешниеСистемыПоТипу Цикл
				РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Ссылка, СтатусСА, ВС.Ссылка);	
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
	// Фиксация синхронизации заявки со сделкой
	СинхронизироватьОбъектСоСделкой();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Актуализировать наименование обращения
//
// Параметры:
//  ИзДанныхКлиента	 - 	 - 
//
Процедура АктуализироватьНаименованиеОбращения(ИзДанныхКлиента = Ложь) Экспорт
	
	Если ИзДанныхКлиента И ЗначениеЗаполнено(ЭтотОбъект.ОсновнойКлиент) Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Справочники.Контрагенты.ПолучитьДанныеФИОКонтрагента(ЭтотОбъект.ОсновнойКлиент));
	КонецЕсли;
	
	// Фамилия.
	ЭтотОбъект.Фамилия = СокрЛП(ЭтотОбъект.Фамилия);
	ЭтотОбъект.Фамилия = УдалитьНедопустимыеСимволыСправа(ТРег(ЭтотОбъект.Фамилия));
	// Имя.
	ЭтотОбъект.Имя = СокрЛП(ЭтотОбъект.Имя);
	ЭтотОбъект.Имя = УдалитьНедопустимыеСимволыСправа(ТРег(ЭтотОбъект.Имя));
	// Отчество.
	ЭтотОбъект.Отчество = СокрЛП(ЭтотОбъект.Отчество);
	ЭтотОбъект.Отчество = УдалитьНедопустимыеСимволыСправа(ТРег(ЭтотОбъект.Отчество));
	
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Фамилия + ?(ЗначениеЗаполнено(ЭтотОбъект.Фамилия), " ", "") + ЭтотОбъект.Имя + ?(ЗначениеЗаполнено(ЭтотОбъект.Имя), " ", "") + ЭтотОбъект.Отчество);

КонецПроцедуры

// Процедура, записывает строку истории изменения статусов.
//
Процедура ЗаписатьИзменениеСтатуса()
	
	Если Статус = Ссылка.Статус И ОсновнойМенеджер = Ссылка.ОсновнойМенеджер Тогда
		// Статус и ответственный сотрудник не изменились, запись не требуется.
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ИзменениеСтатуса					 = ИсторияИзмененияСтатусов.Добавить();
	ИзменениеСтатуса.Дата				 = ТекущаяДата;
	ИзменениеСтатуса.ПереходИзСтатуса	 = Ссылка.Статус;
	ИзменениеСтатуса.ПереходВСтатус		 = Статус;
	ИзменениеСтатуса.Автор				 = ПараметрыСеанса.ТекущийСотрудник;
	
	ДатаОбработки = ?(Ссылка.Пустая(), Неопределено, ТекущаяДата);
	
КонецПроцедуры

// Процедура - Оповестить менеджеров о новой заявке.
//
Процедура ОповеститьМенеджеровОНовойЗаявке()
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый")
		И Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ОповеститьОНовойЗаявке") Тогда
		
		// Оповещение не требуется.
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Создаем оповещение других сеансов о создании новой заявки или изменении существующей.
	НомерТекущегоСеанса	 = НомерСеансаИнформационнойБазы();
	ТекущиеСеансы		 = ПолучитьСеансыИнформационнойБазы();
	ОнлайнЗаявка 		 = ЭтотОбъект.ДополнительныеСвойства.Свойство("ОнлайнЗаявка") = Истина;
	
	// Если активен только один сеанс (текущий) - никого не оповещаем.
	Если ТекущиеСеансы.Количество() > 1 Тогда
		
		СистемаВзаимодействияПодключена = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена() = Истина;
		
		Если Не СистемаВзаимодействияПодключена Тогда
			
			ПараметрыОповещения = Новый Массив;
			ПараметрыОповещения.Добавить(Ссылка);
			ПараметрыОповещения.Добавить(ОсновнойМенеджер);
			ПараметрыОповещения.Добавить(СтруктурнаяЕдиница);
			
		КонецЕсли;
		
		ПользователиОповещения = Новый Массив;
		СеансыОповещения 	   = Новый Массив;
		
		Для Каждого Сеанс Из ТекущиеСеансы Цикл
			
			Если (Сеанс.ИмяПриложения = "1CV8C"
				Или Сеанс.ИмяПриложения = "WebClient") Тогда
			
				Если НомерТекущегоСеанса = Сеанс.НомерСеанса Тогда
					// Текущий сеанс оповещаем с клиента.
					Продолжить;
				КонецЕсли;
				
				Если СистемаВзаимодействияПодключена Тогда 
					ПользователиОповещения.Добавить(Сеанс.Пользователь);
					СеансыОповещения.Добавить(Сеанс.НомерСеанса);
				Иначе
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(
						Сеанс.НомерСеанса,,
						"ОповещениеОНовыхЗаявках",
						ТекущаяДатаСеанса(),,,,
						ПараметрыОповещения
					);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СистемаВзаимодействияПодключена И ЗначениеЗаполнено(ПользователиОповещения) Тогда
			
			ДанныеСообщения = Новый Структура;
			ДанныеСообщения.Вставить("Ключ"					, "ОповещениеОНовыхЗаявках");
			ДанныеСообщения.Вставить("Заявка"				, Ссылка);
			ДанныеСообщения.Вставить("Сотрудник"			, ?(ОсновнойМенеджер.Пустая(), Неопределено, ОсновнойМенеджер));
			ДанныеСообщения.Вставить("СтруктурнаяЕдиница"	, ?(СтруктурнаяЕдиница.Пустая(), Неопределено, СтруктурнаяЕдиница));
			
			ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения,, ПользователиОповещения);
			
			Если ОнлайнЗаявка = Истина Тогда
				
				// Если заявка была создана через Http сервисы, оповещаем регистратуру
				АктивныеСотрудники = ОбсужденияСистемыВзаимодействия.ПолучитьМассивАктивныхСотрудников(,,
					СеансыОповещения, 
					СтруктурнаяЕдиница, 
					Перечисления.РольПользователя.Регистратура
				);   
				
				Если ЗначениеЗаполнено(АктивныеСотрудники) Тогда
					ДанныеСообщения.Вставить("ОнлайнЗаявка", Истина);
					ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, АктивныеСотрудники);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Разбирает представление контактной информации и возвращает строку XML.
//
Функция КонтактнаяИнформацияXMLПоПредставлению(Знач НомерТелефона, ОжидаемыйВид, СтруктурнаяЕдиница)
	
	ОжидаемыйТип = УправлениеКонтактнойИнформациейСлужебныйПовтИсп.ТипВидаКонтактнойИнформации(ОжидаемыйВид);
	
	ЗначенияПолей = Новый СписокЗначений;
	УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(НомерТелефона, ЗначенияПолей,, СтруктурнаяЕдиница);
	
	Возврат УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(УправлениеКонтактнойИнформациейСлужебный.ДесериализацияТелефона(ЗначенияПолей, НомерТелефона, ОжидаемыйТип));
	
КонецФункции

Функция СократитьGoogleID(ga_id)
	
	Массив = СтрРазделить(ga_id,".");
	Если Массив.Количество()=4 Тогда
		Возврат ""+Массив[Массив.Количество()-2]+"."+Массив[Массив.Количество()-1];
	Иначе
		ВОзврат ga_id;
	КонецЕсли
	
КонецФункции

// Процедура - Синхронизировать объект со сделкой
//
Процедура СинхронизироватьОбъектСоСделкой()
	
	// Синхронизации в данной транзакции еще не было. Начинаем.
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("СделкаСинхронизации") Тогда
		Сделка = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СделкаСинхронизации", Сделка);
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ИнтерактивнаяЗапись") Тогда
			Возврат; // Синхронизация должна проводится пользователем интерактивно
		КонецЕсли;	
		Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята И ЗначениеЗаполнено(ЭтотОбъект.ОсновнойКлиент) И ЭтотОбъект.Ссылка.Пустая() Тогда 
			Сделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(ЭтотОбъект.ОсновнойКлиент, ?(ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница), ЭтотОбъект.СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница), Истина);
			Если ЗначениеЗаполнено(Сделка) Тогда 
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СделкаСинхронизации", Сделка);
				Возврат;
			КонецЕсли;	
		ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята Или ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Отклонена Тогда 
			Возврат;
		КонецЕсли;	
		
	    // Убедимся, что нет сделок с такой заявкой		
		Если НЕ ЭтотОбъект.Ссылка.Пустая() Тогда 
			Сделка = Справочники.Сделки.ПолучитьСделкуПоЗаявке(ЭтотОбъект.Ссылка);
			Если ЗначениеЗаполнено(Сделка) Тогда 
				Если ЗначениеЗаполнено(ЭтотОбъект.ОсновнойКлиент) Тогда 
					Если ЭтотОбъект.ОсновнойКлиент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "Контрагент") Тогда 
						ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята;
					КонецЕсли;	
				Иначе 
					ЭтотОбъект.ОсновнойКлиент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "Контрагент");
					ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята;
				КонецЕсли;
				Возврат;
			КонецЕсли;	
		Иначе 
			Сделка = Неопределено;
		КонецЕсли;	
	
		Если ЗначениеЗаполнено(Сделка) Тогда 
			Возврат;
		КонецЕсли;
		
		// Продолжаем поиск по клиенту
		Если ЗначениеЗаполнено(ЭтотОбъект.ОсновнойКлиент) Тогда 
			Сделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(ЭтотОбъект.ОсновнойКлиент, ?(ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница), ЭтотОбъект.СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница), Истина);
			Если ЗначениеЗаполнено(Сделка) Тогда
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СделкаСинхронизации", Сделка);
				ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята;
			КонецЕсли;	
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.КонтактнаяИнформация) Тогда 
			МассивКлиентов = Новый Массив;
			Для Каждого СтрокаКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
				ДублиКлиентов = Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(Неопределено, СтрокаКИ.Тип, СтрокаКИ.Представление);
				Если ЗначениеЗаполнено(ДублиКлиентов) Тогда
					ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивКлиентов, ДублиКлиентов, Истина);
				КонецЕсли;
			КонецЦикла;
			Если МассивКлиентов.Количество() > 0 Тогда 
				Если ЗначениеЗаполнено(МассивКлиентов[0]) Тогда 
					Сделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(МассивКлиентов[0], ?(ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница), ЭтотОбъект.СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница), Истина);
					Если ЗначениеЗаполнено(Сделка) Тогда
						ЭтотОбъект.ДополнительныеСвойства.Вставить("СделкаСинхронизации", Сделка);
						ЭтотОбъект.ОсновнойКлиент = МассивКлиентов[0];
						ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Принята;
					КонецЕсли;						
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	// Синхронизации проведена. Фиксируем результаты, если есть.		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.СделкаСинхронизации) Тогда  
		СделкаОбъект = ЭтотОбъект.ДополнительныеСвойства.СделкаСинхронизации.ПолучитьОбъект();
		СделкаОбъект.Заявка = ЭтотОбъект.Ссылка;
		СделкаОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			СделкаОбъект.Записать();
		Исключение
			ШаблонКомментария = НСтр("ru = 'Не удалось синхронизировать заявку со сделкой ""%1"". Ошибка при записи сделки
			|по причине: %2'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			ЭтотОбъект.ДополнительныеСвойства.СделкаСинхронизации,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			"Заявки.Синхронизация заявки со сделкой",
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.Сделки,,
			Комментарий);
			
			// ВызватьИсключение;
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Установить признак первичного пациента
//
Процедура УстановитьПризнакПервичногоПациента()
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОсновнойКлиент) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"		, ЭтотОбъект.Ссылка);		
	Запрос.УстановитьПараметр("ВидСделки"	, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));	
	Запрос.УстановитьПараметр("Контрагент"	, ЭтотОбъект.ОсновнойКлиент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.Регистратор) КАК КоличествоПриемов
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Контрагент = &Контрагент
	|	И Продажи.Период < &ДатаОбращения
	|	И Продажи.Регистратор ССЫЛКА Документ.Прием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделки.Ссылка) КАК КоличествоСделок,
	|	Сделки.ВидСделки КАК ВидСделки
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.ВидСделки = &ВидСделки
	|	И Сделки.Контрагент = &Контрагент
	|	И Сделки.ДатаСделки <= &ДатаОбращения
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.ВидСделки";	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;		

	Запрос.УстановитьПараметр("ДатаОбращения"	, ?(НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаСоздания) ИЛИ НачалоДня(ЭтотОбъект.ДатаСоздания) = НачалоДня(ТекущаяДатаСеанса()), ТекущаяДатаСеанса(), ЭтотОбъект.ДатаСоздания)); 
	
	РезультатПакетногоЗапроса 	= Запрос.ВыполнитьПакет();
	ВыборкаКоличестваПриемов 	= РезультатПакетногоЗапроса[0].Выбрать();
	ВыборкаКоличестваСделок 	= РезультатПакетногоЗапроса[1].Выбрать();
	
	Если ВыборкаКоличестваПриемов.Следующий() Тогда
		ЭтотОбъект.СтатусПациента = ?(ВыборкаКоличестваПриемов.КоличествоПриемов > 0, Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный);
		Если ЭтотОбъект.СтатусПациента = Перечисления.СтатусыКонтрагентов.Первичный И ВыборкаКоличестваСделок.Следующий() Тогда 
			ЭтотОбъект.СтатусПациента = ?(ВыборкаКоличестваСделок.КоличествоСделок > 0, Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный);
		КонецЕсли;	
	Иначе
		Если ВыборкаКоличестваСделок.Следующий() Тогда
			ЭтотОбъект.СтатусПациента = ?(ВыборкаКоличестваСделок.КоличествоСделок > 0, Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный);
		Иначе 
			ЭтотОбъект.СтатусПациента = Перечисления.СтатусыКонтрагентов.Первичный;		
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
